.benchmark/hello.yml
config:
  # Use this for localhost benchmarking
  target: 'http://localhost:3004'
  phases:
    - duration: 60
      arrivalRate: 200
      rampTo: 200
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "Load page"
    flow:
    - get:
        url: "/restaurants/100"